## Exploratory Data Analysis using SQL

#### Download the Datasets

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [1]:
#!pip install sqlalchemy==1.3.9

In [2]:
# Uncomment and execute the below code if you want to work locally

#!pip install ipython-sql

In [3]:
%load_ext sql

In [4]:
import csv
import sqlite3

connection = sqlite3.connect('my_data1.db')
cursor = connection.cursor()

In [5]:
%sql sqlite:///my_data1.db

In [6]:
#!pip install -q pandas==1.1.5

import pandas as pd
df = pd.read_csv('https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv')
df.to_sql("SPACEXTBL", connection, if_exists = 'replace', index = False, method = 'multi')

101

In [7]:
# Use below code to remove blank rows from the table

%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null;

 * sqlite:///my_data1.db
Done.

[]

#### Task 1: Display the names of the unique launch sites in the space mission

In [8]:
# Getting table info
#%sql pragma table_info(SPACEXTABLE)
#%sql select * from SPACEXTABLE limit 5;

# Unique values in the Launch site column
%sql select distinct "Launch_Site" from SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

#### Task 2: Display 5 records where launch site begins with the string 'CCA'

In [9]:
%sql select * from SPACEXTABLE where "Launch_Site" like 'CCA%' limit 5;

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

#### Task 3: Display the total payload mass carried by boosters launched by NASA (CRS)

In [10]:
%sql select sum("PAYLOAD_MASS__KG_") as 'Total Payload Mass by NASA (CRS)' from SPACEXTABLE where Customer = 'NASA (CRS)';

 * sqlite:///my_data1.db
Done.

[(45596,)]

#### Task 4: Display average payload mass carried by

In [11]:
%sql select avg("PAYLOAD_MASS__KG_") from SPACEXTABLE where "Booster_Version" = 'F9 v1.1';

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

#### Task 5: List the date when the first successful landing outcome on ground ad was achieved

In [12]:
%sql select min("Date") from SPACEXTABLE where "Landing_Outcome" = 'Success (ground pad)';

 * sqlite:///my_data1.db
Done.

[('2015-12-22',)]

#### Task 6: List the name of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [13]:
%sql select distinct "Booster_Version" from SPACEXTABLE where "Landing_Outcome" = 'Success (drone ship)' and "PAYLOAD_MASS__KG_" between 4000 and 6000;

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

#### Task 7: List total number of successful and failure mission outcomes

In [14]:
# Success outcomes
%sql select count("Landing_Outcome") as 'No of successes' from SPACEXTABLE where "Landing_Outcome" like 'Success%';

 * sqlite:///my_data1.db
Done.

[(61,)]

In [15]:
# Failure outcomes
%sql select count("Landing_Outcome") as 'No of failures' from SPACEXTABLE where "Landing_Outcome" like 'Failure%';

 * sqlite:///my_data1.db
Done.

[(10,)]

#### Task 8: List the names of booster versions which have carried the maximum payload mass

In [16]:
%sql select distinct "Booster_Version" from SPACEXTABLE where "PAYLOAD_MASS__KG_" = (select max("PAYLOAD_MASS__KG_") from SPACEXTABLE);

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

#### Task 9: List the records which will display the month names, failure landing_outcomes in drone ship, booster versions, launch site for the months in year 2015

In [17]:
%sql select substr("Date", 6, 2) as 'Month', "Landing_Outcome", "Booster_Version", "Launch_Site" from SPACEXTABLE where "Landing_Outcome" = 'Failure (drone ship)' and substr("Date", 0, 5) = '2015';

 * sqlite:///my_data1.db
Done.

[('01', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('04', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

#### Task 10: Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20 in descending order

In [18]:
%sql select "Landing_Outcome", count("Landing_Outcome") as 'Count' from SPACEXTABLE where "Date" between '2010-06-04' and '2017-03-20' group by "Landing_Outcome" order by "Count" Desc;

 * sqlite:///my_data1.db
Done.

[('No attempt', 10),
 ('Success (drone ship)', 5),
 ('Failure (drone ship)', 5),
 ('Success (ground pad)', 3),
 ('Controlled (ocean)', 3),
 ('Uncontrolled (ocean)', 2),
 ('Failure (parachute)', 2),
 ('Precluded (drone ship)', 1)]

#### Practice - Ignore

In [19]:
%sql select Date, Landing_Outcome from SPACEXTABLE where Date between "2010-06-04" and '2017-03-20';

 * sqlite:///my_data1.db
Done.

[('2010-06-04', 'Failure (parachute)'),
 ('2010-12-08', 'Failure (parachute)'),
 ('2012-05-22', 'No attempt'),
 ('2012-10-08', 'No attempt'),
 ('2013-03-01', 'No attempt'),
 ('2013-09-29', 'Uncontrolled (ocean)'),
 ('2013-12-03', 'No attempt'),
 ('2014-01-06', 'No attempt'),
 ('2014-04-18', 'Controlled (ocean)'),
 ('2014-07-14', 'Controlled (ocean)'),
 ('2014-08-05', 'No attempt'),
 ('2014-09-07', 'No attempt'),
 ('2014-09-21', 'Uncontrolled (ocean)'),
 ('2015-01-10', 'Failure (drone ship)'),
 ('2015-02-11', 'Controlled (ocean)'),
 ('2015-03-02', 'No attempt'),
 ('2015-04-14', 'Failure (drone ship)'),
 ('2015-04-27', 'No attempt'),
 ('2015-06-28', 'Precluded (drone ship)'),
 ('2015-12-22', 'Success (ground pad)'),
 ('2016-01-17', 'Failure (drone ship)'),
 ('2016-03-04', 'Failure (drone ship)'),
 ('2016-04-08', 'Success (drone ship)'),
 ('2016-05-06', 'Success (drone ship)'),
 ('2016-05-27', 'Success (drone ship)'),
 ('2016-06-15', 'Failure (drone ship)'),
 ('2016-07-18', 'Success (ground pad)'),
 ('2016-08-14', 'Success (drone ship)'),
 ('2017-01-14', 'Success (drone ship)'),
 ('2017-02-19', 'Success (ground pad)'),
 ('2017-03-16', 'No attempt')]

In [20]:
import datetime
df['Date'] = pd.to_datetime(df['Date']).dt.date

In [21]:
%sql select * from SPACEXTABLE limit 5;

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

In [22]:
%sql select distinct Landing_Outcome from SPACEXTABLE

 * sqlite:///my_data1.db
Done.

[('Failure (parachute)',),
 ('No attempt',),
 ('Uncontrolled (ocean)',),
 ('Controlled (ocean)',),
 ('Failure (drone ship)',),
 ('Precluded (drone ship)',),
 ('Success (ground pad)',),
 ('Success (drone ship)',),
 ('Success',),
 ('Failure',),
 ('No attempt ',)]